package module_2;
import java.util.Scanner;

//Задача 11
//Вводится натуральное число. Найти сумму четных цифр, входящих в его состав.
//тест: при вводе числа "1474" на выходе получим "8", так как четными являются лишь две цифры "4".

//        public class task_11a {
//            public static void main(String[] args) {
//                Scanner scan = new Scanner(System.in);
//                int n = scan.nextInt();
//                int sum = 0;
//                sum(n, sum);
//            }
//
//            public static void sum(int n, int sum) {
//               if (n != 0) ((n % 2) == 0);
//            {
//                    sum += n % 10;
//                    sum(n / 10, sum);
//                }
//                    if else{
//                        System.out.println(sum);
//
//                }
//            }
//}